benchmarksuite/InterfaceCapturing/advection/discUniFlowTet/discUniFlowTet/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
	location		"system";
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "simulationParameter"

application     interfaceAdvector;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         0.5;

writeControl    adjustableRunTime;

writeInterval   0.5;

deltaT          1e-3;

purgeWrite      0;

writeFormat     ascii;

writePrecision  14;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable no;

adjustTimeStep  yes;

maxCo           1e10;
maxAlphaCo      $MAXCFL;

maxDeltaT       1e6;

functions
{
	volumeFractionError
	{
		type volumeFractionError;
		libs ("libpostProcess.so");
		field alpha.water;
        functionType cylinder;
        radius 0.20;
        direction (0 1 0);
        origin (0.25 0 0.25);
		writeControl    adjustableRunTime;
		writeInterval   0.1;
		writePrecision 	16;
	}
}


// ************************************************************************* //
